zengwangfa/Underwater-Vehicle/software/18.8.21最终)/Chip/inc/kinetis/MK51DZ10.h
/* OPAMP - Register accessors */
#define OPAMP_C0_REG(base)                       ((base)->C0)
#define OPAMP_C1_REG(base)                       ((base)->C1)
#define OPAMP_C2_REG(base)                       ((base)->C2)

/**
 * @}
 */ /* end of group OPAMP_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- OPAMP Register Masks
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup OPAMP_Register_Masks OPAMP Register Masks
 * @{
 */

/* C0 Bit Fields */
#define OPAMP_C0_MODE_MASK                       0x3u
#define OPAMP_C0_MODE_SHIFT                      0
#define OPAMP_C0_MODE(x)                         (((uint8_t)(((uint8_t)(x))<<OPAMP_C0_MODE_SHIFT))&OPAMP_C0_MODE_MASK)
#define OPAMP_C0_LPEN_MASK                       0x40u
#define OPAMP_C0_LPEN_SHIFT                      6
#define OPAMP_C0_EN_MASK                         0x80u
#define OPAMP_C0_EN_SHIFT                        7
/* C1 Bit Fields */
#define OPAMP_C1_AMPRI_MASK                      0x3u
#define OPAMP_C1_AMPRI_SHIFT                     0
#define OPAMP_C1_AMPRI(x)                        (((uint8_t)(((uint8_t)(x))<<OPAMP_C1_AMPRI_SHIFT))&OPAMP_C1_AMPRI_MASK)
#define OPAMP_C1_AMPRF_MASK                      0x1Cu
#define OPAMP_C1_AMPRF_SHIFT                     2
#define OPAMP_C1_AMPRF(x)                        (((uint8_t)(((uint8_t)(x))<<OPAMP_C1_AMPRF_SHIFT))&OPAMP_C1_AMPRF_MASK)
/* C2 Bit Fields */
#define OPAMP_C2_AMPNSEL_MASK                    0x7u
#define OPAMP_C2_AMPNSEL_SHIFT                   0
#define OPAMP_C2_AMPNSEL(x)                      (((uint8_t)(((uint8_t)(x))<<OPAMP_C2_AMPNSEL_SHIFT))&OPAMP_C2_AMPNSEL_MASK)
#define OPAMP_C2_AMPPSEL_MASK                    0x70u
#define OPAMP_C2_AMPPSEL_SHIFT                   4
#define OPAMP_C2_AMPPSEL(x)                      (((uint8_t)(((uint8_t)(x))<<OPAMP_C2_AMPPSEL_SHIFT))&OPAMP_C2_AMPPSEL_MASK)

/**
 * @}
 */ /* end of group OPAMP_Register_Masks */


/* OPAMP - Peripheral instance base addresses */
/** Peripheral OPAMP0 base pointer */
#define OPAMP0_BASE_PTR                          ((OPAMP_MemMapPtr)0x400F5000u)
/** Peripheral OPAMP1 base pointer */
#define OPAMP1_BASE_PTR                          ((OPAMP_MemMapPtr)0x400F5800u)

/* ----------------------------------------------------------------------------
   -- OPAMP - Register accessor macros
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup OPAMP_Register_Accessor_Macros OPAMP - Register accessor macros
 * @{
 */


/* OPAMP - Register instance definitions */
/* OPAMP0 */
#define OPAMP0_C0                                OPAMP_C0_REG(OPAMP0_BASE_PTR)
#define OPAMP0_C1                                OPAMP_C1_REG(OPAMP0_BASE_PTR)
#define OPAMP0_C2                                OPAMP_C2_REG(OPAMP0_BASE_PTR)
/* OPAMP1 */
#define OPAMP1_C0                                OPAMP_C0_REG(OPAMP1_BASE_PTR)
#define OPAMP1_C1                                OPAMP_C1_REG(OPAMP1_BASE_PTR)
#define OPAMP1_C2                                OPAMP_C2_REG(OPAMP1_BASE_PTR)

/**
 * @}
 */ /* end of group OPAMP_Register_Accessor_Macros */


/**
 * @}
 */ /* end of group OPAMP_Peripheral */


/* ----------------------------------------------------------------------------
   -- OSC
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup OSC_Peripheral OSC
 * @{
 */

/** OSC - Peripheral register structure */
typedef struct OSC_MemMap {
  uint8_t CR;                                      /**< OSC Control Register, offset: 0x0 */
} volatile *OSC_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- OSC - Register accessor macros
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup OSC_Register_Accessor_Macros OSC - Register accessor macros
 * @{
 */


/* OSC - Register accessors */
#define OSC_CR_REG(base)                         ((base)->CR)

/**
 * @}
 */ /* end of group OSC_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- OSC Register Masks
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup OSC_Register_Masks OSC Register Masks
 * @{
 */

/* CR Bit Fields */
#define OSC_CR_SC16P_MASK                        0x1u
#define OSC_CR_SC16P_SHIFT                       0
#define OSC_CR_SC8P_MASK                         0x2u
#define OSC_CR_SC8P_SHIFT                        1
#define OSC_CR_SC4P_MASK                         0x4u
#define OSC_CR_SC4P_SHIFT                        2
#define OSC_CR_SC2P_MASK                         0x8u
#define OSC_CR_SC2P_SHIFT                        3
#define OSC_CR_EREFSTEN_MASK                     0x20u
#define OSC_CR_EREFSTEN_SHIFT                    5
#define OSC_CR_ERCLKEN_MASK                      0x80u
#define OSC_CR_ERCLKEN_SHIFT                     7

/**
 * @}
 */ /* end of group OSC_Register_Masks */


/* OSC - Peripheral instance base addresses */
/** Peripheral OSC base pointer */
#define OSC_BASE_PTR                             ((OSC_MemMapPtr)0x40065000u)

/* ----------------------------------------------------------------------------
   -- OSC - Register accessor macros
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup OSC_Register_Accessor_Macros OSC - Register accessor macros
 * @{
 */


/* OSC - Register instance definitions */
/* OSC */
#define OSC_CR                                   OSC_CR_REG(OSC_BASE_PTR)

/**
 * @}
 */ /* end of group OSC_Register_Accessor_Macros */


/**
 * @}
 */ /* end of group OSC_Peripheral */


/* ----------------------------------------------------------------------------
   -- PDB
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup PDB_Peripheral PDB
 * @{
 */

/** PDB - Peripheral register structure */
typedef struct PDB_MemMap {
  uint32_t SC;                                     /**< Status and Control Register, offset: 0x0 */
  uint32_t MOD;                                    /**< Modulus Register, offset: 0x4 */
  uint32_t CNT;                                    /**< Counter Register, offset: 0x8 */
  uint32_t IDLY;                                   /**< Interrupt Delay Register, offset: 0xC */
  struct {                                         /* offset: 0x10, array step: 0x28 */
    uint32_t C1;                                     /**< Channel n Control Register 1, array offset: 0x10, array step: 0x28 */
    uint32_t S;                                      /**< Channel n Status Register, array offset: 0x14, array step: 0x28 */
    uint32_t DLY[2];                                 /**< Channel n Delay 0 Register..Channel n Delay 1 Register, array offset: 0x18, array step: index*0x28, index2*0x4 */
    uint8_t RESERVED_0[24];
  } CH[2];
  uint8_t RESERVED_0[240];
  struct {                                         /* offset: 0x150, array step: 0x8 */
    uint32_t INTC;                                   /**< DAC Interval Trigger n Control Register, array offset: 0x150, array step: 0x8 */
    uint32_t INT;                                    /**< DAC Interval n Register, array offset: 0x154, array step: 0x8 */
  } DAC[2];
  uint8_t RESERVED_1[48];
  uint32_t POEN;                                   /**< Pulse-Out n Enable Register, offset: 0x190 */
  uint32_t PODLY;                                  /**< Pulse-Out n Delay Register, offset: 0x194 */
} volatile *PDB_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- PDB - Register accessor macros
   ---------------------------------------------------------------------------- */

/**
 * @addtogroup PDB_Register_Accessor_Macros PDB - Register accessor macros
 * @{
 */


